# словарь компаний и их ID на сайте hh.ru
employers1 = {
    'T2': '4219',
    'ВсеИнструменты.ру': '208707',
    'X5 Group': '4233',
    'Мегафон': '3127',
    'Сбер': '3529',
    'Альфа-Банк': '80',
    'Яндекс': '1740',
    'ВТБ Лизинг': '84355',
    'Газпромбанк': '3388',
    'Lamoda': '780654'
}

# словарь компаний и их ID на сайте hh.ru
employers = {
    'Мегафон': '3127',
    'Сбер': '3529',
    'Альфа-Банк': '80',
    'Яндекс': '1740',
    'ВТБ Лизинг': '84355',
    'Газпромбанк': '3388',
    'Lamoda': '780654',
    'T2': '4219',
    'ВсеИнструменты.ру': '208707',
    'X5 Group': '4233'
}