import os
from pathlib import Path

BASE_DIR = str(Path(__file__).parent.parent)
DATA_DIR = BASE_DIR + '\\data\\'

# FILE_NAME_API = 'VACANCIES_API'
# PATH_TO_VACANCIES_FILE = os.path.join(DATA_DIR, FILE_NAME_API)

DB_NAME = 'top_employers'

# словарь компаний и их ID на сайте hh.ru
EMPLOYERS = {
    'Мегафон': '3127',
    'Сбер': '3529',
    'Альфа-Банк': '80'
}

EMPLOYERS1 = {
    'Мегафон': '3127',
    'Сбер': '3529',
    'Альфа-Банк': '80',
    'Яндекс': '1740',
    'ВТБ Лизинг': '84355',
    'Газпромбанк': '3388',
    'Lamoda': '780654',
    'T2': '4219',
    'ВсеИнструменты.ру': '208707',
    'X5 Group': '4233'
}

USER_MENU_LIST = [
    '1. Список всех компаний и количество их вакансий.',
    '2. Список компаний, наименования вакансий, уровень зарплаты и ссылка на вакансию.',
    '3. Средняя зарплата по вакансиям.',
    '4. Список вакансий, уровень зарплаты по которым выше среднего уровня по всем вакансиям.',
    '5. Список вакансий по ключевому слову в наименовании вакансии.',
    '6. Сохранить выборку в Excel.',
    '0. На сегодня хватит ;)'
]

YES_NO_CHOICE = ['1. Да', '0. Нет']
